GopalSaraf/Practicals/PSDL/include/proc/pic16c923.inc
// Register: LCDD05
#define LCDD05 LCDD05
LCDD05                                   equ 0115h
// bitfield definitions
LCDD05_SEG08_POSN                        equ 0000h
LCDD05_SEG08_POSITION                    equ 0000h
LCDD05_SEG08_SIZE                        equ 0001h
LCDD05_SEG08_LENGTH                      equ 0001h
LCDD05_SEG08_MASK                        equ 0001h
LCDD05_SEG09_POSN                        equ 0001h
LCDD05_SEG09_POSITION                    equ 0001h
LCDD05_SEG09_SIZE                        equ 0001h
LCDD05_SEG09_LENGTH                      equ 0001h
LCDD05_SEG09_MASK                        equ 0002h
LCDD05_SEG10_POSN                        equ 0002h
LCDD05_SEG10_POSITION                    equ 0002h
LCDD05_SEG10_SIZE                        equ 0001h
LCDD05_SEG10_LENGTH                      equ 0001h
LCDD05_SEG10_MASK                        equ 0004h
LCDD05_SEG11_POSN                        equ 0003h
LCDD05_SEG11_POSITION                    equ 0003h
LCDD05_SEG11_SIZE                        equ 0001h
LCDD05_SEG11_LENGTH                      equ 0001h
LCDD05_SEG11_MASK                        equ 0008h
LCDD05_SEG12_POSN                        equ 0004h
LCDD05_SEG12_POSITION                    equ 0004h
LCDD05_SEG12_SIZE                        equ 0001h
LCDD05_SEG12_LENGTH                      equ 0001h
LCDD05_SEG12_MASK                        equ 0010h
LCDD05_SEG13_POSN                        equ 0005h
LCDD05_SEG13_POSITION                    equ 0005h
LCDD05_SEG13_SIZE                        equ 0001h
LCDD05_SEG13_LENGTH                      equ 0001h
LCDD05_SEG13_MASK                        equ 0020h
LCDD05_SEG14_POSN                        equ 0006h
LCDD05_SEG14_POSITION                    equ 0006h
LCDD05_SEG14_SIZE                        equ 0001h
LCDD05_SEG14_LENGTH                      equ 0001h
LCDD05_SEG14_MASK                        equ 0040h
LCDD05_SEG15_POSN                        equ 0007h
LCDD05_SEG15_POSITION                    equ 0007h
LCDD05_SEG15_SIZE                        equ 0001h
LCDD05_SEG15_LENGTH                      equ 0001h
LCDD05_SEG15_MASK                        equ 0080h

// Register: LCDD06
#define LCDD06 LCDD06
LCDD06                                   equ 0116h
// bitfield definitions
LCDD06_SEG16_POSN                        equ 0000h
LCDD06_SEG16_POSITION                    equ 0000h
LCDD06_SEG16_SIZE                        equ 0001h
LCDD06_SEG16_LENGTH                      equ 0001h
LCDD06_SEG16_MASK                        equ 0001h
LCDD06_SEG17_POSN                        equ 0001h
LCDD06_SEG17_POSITION                    equ 0001h
LCDD06_SEG17_SIZE                        equ 0001h
LCDD06_SEG17_LENGTH                      equ 0001h
LCDD06_SEG17_MASK                        equ 0002h
LCDD06_SEG18_POSN                        equ 0002h
LCDD06_SEG18_POSITION                    equ 0002h
LCDD06_SEG18_SIZE                        equ 0001h
LCDD06_SEG18_LENGTH                      equ 0001h
LCDD06_SEG18_MASK                        equ 0004h
LCDD06_SEG19_POSN                        equ 0003h
LCDD06_SEG19_POSITION                    equ 0003h
LCDD06_SEG19_SIZE                        equ 0001h
LCDD06_SEG19_LENGTH                      equ 0001h
LCDD06_SEG19_MASK                        equ 0008h
LCDD06_SEG20_POSN                        equ 0004h
LCDD06_SEG20_POSITION                    equ 0004h
LCDD06_SEG20_SIZE                        equ 0001h
LCDD06_SEG20_LENGTH                      equ 0001h
LCDD06_SEG20_MASK                        equ 0010h
LCDD06_SEG21_POSN                        equ 0005h
LCDD06_SEG21_POSITION                    equ 0005h
LCDD06_SEG21_SIZE                        equ 0001h
LCDD06_SEG21_LENGTH                      equ 0001h
LCDD06_SEG21_MASK                        equ 0020h
LCDD06_SEG22_POSN                        equ 0006h
LCDD06_SEG22_POSITION                    equ 0006h
LCDD06_SEG22_SIZE                        equ 0001h
LCDD06_SEG22_LENGTH                      equ 0001h
LCDD06_SEG22_MASK                        equ 0040h
LCDD06_SEG23_POSN                        equ 0007h
LCDD06_SEG23_POSITION                    equ 0007h
LCDD06_SEG23_SIZE                        equ 0001h
LCDD06_SEG23_LENGTH                      equ 0001h
LCDD06_SEG23_MASK                        equ 0080h

// Register: LCDD07
#define LCDD07 LCDD07
LCDD07                                   equ 0117h
// bitfield definitions
LCDD07_SEG24_POSN                        equ 0000h
LCDD07_SEG24_POSITION                    equ 0000h
LCDD07_SEG24_SIZE                        equ 0001h
LCDD07_SEG24_LENGTH                      equ 0001h
LCDD07_SEG24_MASK                        equ 0001h
LCDD07_SEG25_POSN                        equ 0001h
LCDD07_SEG25_POSITION                    equ 0001h
LCDD07_SEG25_SIZE                        equ 0001h
LCDD07_SEG25_LENGTH                      equ 0001h
LCDD07_SEG25_MASK                        equ 0002h
LCDD07_SEG26_POSN                        equ 0002h
LCDD07_SEG26_POSITION                    equ 0002h
LCDD07_SEG26_SIZE                        equ 0001h
LCDD07_SEG26_LENGTH                      equ 0001h
LCDD07_SEG26_MASK                        equ 0004h
LCDD07_SEG27_POSN                        equ 0003h
LCDD07_SEG27_POSITION                    equ 0003h
LCDD07_SEG27_SIZE                        equ 0001h
LCDD07_SEG27_LENGTH                      equ 0001h
LCDD07_SEG27_MASK                        equ 0008h
LCDD07_SEG28_POSN                        equ 0004h
LCDD07_SEG28_POSITION                    equ 0004h
LCDD07_SEG28_SIZE                        equ 0001h
LCDD07_SEG28_LENGTH                      equ 0001h
LCDD07_SEG28_MASK                        equ 0010h
LCDD07_SEG29_POSN                        equ 0005h
LCDD07_SEG29_POSITION                    equ 0005h
LCDD07_SEG29_SIZE                        equ 0001h
LCDD07_SEG29_LENGTH                      equ 0001h
LCDD07_SEG29_MASK                        equ 0020h
LCDD07_SEG30_POSN                        equ 0006h
LCDD07_SEG30_POSITION                    equ 0006h
LCDD07_SEG30_SIZE                        equ 0001h
LCDD07_SEG30_LENGTH                      equ 0001h
LCDD07_SEG30_MASK                        equ 0040h
LCDD07_SEG31_POSN                        equ 0007h
LCDD07_SEG31_POSITION                    equ 0007h
LCDD07_SEG31_SIZE                        equ 0001h
LCDD07_SEG31_LENGTH                      equ 0001h
LCDD07_SEG31_MASK                        equ 0080h

// Register: LCDD08
#define LCDD08 LCDD08
LCDD08                                   equ 0118h
// bitfield definitions
LCDD08_SEG00_POSN                        equ 0000h
LCDD08_SEG00_POSITION                    equ 0000h
LCDD08_SEG00_SIZE                        equ 0001h
LCDD08_SEG00_LENGTH                      equ 0001h
LCDD08_SEG00_MASK                        equ 0001h
LCDD08_SEG01_POSN                        equ 0001h
LCDD08_SEG01_POSITION                    equ 0001h
LCDD08_SEG01_SIZE                        equ 0001h
LCDD08_SEG01_LENGTH                      equ 0001h
LCDD08_SEG01_MASK                        equ 0002h
LCDD08_SEG02_POSN                        equ 0002h
LCDD08_SEG02_POSITION                    equ 0002h
LCDD08_SEG02_SIZE                        equ 0001h
LCDD08_SEG02_LENGTH                      equ 0001h
LCDD08_SEG02_MASK                        equ 0004h
LCDD08_SEG03_POSN                        equ 0003h
LCDD08_SEG03_POSITION                    equ 0003h
LCDD08_SEG03_SIZE                        equ 0001h
LCDD08_SEG03_LENGTH                      equ 0001h
LCDD08_SEG03_MASK                        equ 0008h
LCDD08_SEG04_POSN                        equ 0004h
LCDD08_SEG04_POSITION                    equ 0004h
LCDD08_SEG04_SIZE                        equ 0001h
LCDD08_SEG04_LENGTH                      equ 0001h
LCDD08_SEG04_MASK                        equ 0010h
LCDD08_SEG05_POSN                        equ 0005h
LCDD08_SEG05_POSITION                    equ 0005h
LCDD08_SEG05_SIZE                        equ 0001h
LCDD08_SEG05_LENGTH                      equ 0001h
LCDD08_SEG05_MASK                        equ 0020h
LCDD08_SEG06_POSN                        equ 0006h
LCDD08_SEG06_POSITION                    equ 0006h
LCDD08_SEG06_SIZE                        equ 0001h
LCDD08_SEG06_LENGTH                      equ 0001h
LCDD08_SEG06_MASK                        equ 0040h
LCDD08_SEG07_POSN                        equ 0007h
LCDD08_SEG07_POSITION                    equ 0007h
LCDD08_SEG07_SIZE                        equ 0001h
LCDD08_SEG07_LENGTH                      equ 0001h
LCDD08_SEG07_MASK                        equ 0080h

// Register: LCDD09
#define LCDD09 LCDD09
LCDD09                                   equ 0119h
// bitfield definitions
LCDD09_SEG08_POSN                        equ 0000h
LCDD09_SEG08_POSITION                    equ 0000h
LCDD09_SEG08_SIZE                        equ 0001h
LCDD09_SEG08_LENGTH                      equ 0001h
LCDD09_SEG08_MASK                        equ 0001h
LCDD09_SEG09_POSN                        equ 0001h
LCDD09_SEG09_POSITION                    equ 0001h
LCDD09_SEG09_SIZE                        equ 0001h
LCDD09_SEG09_LENGTH                      equ 0001h
LCDD09_SEG09_MASK                        equ 0002h
LCDD09_SEG10_POSN                        equ 0002h
LCDD09_SEG10_POSITION                    equ 0002h
LCDD09_SEG10_SIZE                        equ 0001h
LCDD09_SEG10_LENGTH                      equ 0001h
LCDD09_SEG10_MASK                        equ 0004h
LCDD09_SEG11_POSN                        equ 0003h
LCDD09_SEG11_POSITION                    equ 0003h
LCDD09_SEG11_SIZE                        equ 0001h
LCDD09_SEG11_LENGTH                      equ 0001h
LCDD09_SEG11_MASK                        equ 0008h
LCDD09_SEG12_POSN                        equ 0004h
LCDD09_SEG12_POSITION                    equ 0004h
LCDD09_SEG12_SIZE                        equ 0001h
LCDD09_SEG12_LENGTH                      equ 0001h
LCDD09_SEG12_MASK                        equ 0010h
LCDD09_SEG13_POSN                        equ 0005h
LCDD09_SEG13_POSITION                    equ 0005h
LCDD09_SEG13_SIZE                        equ 0001h
LCDD09_SEG13_LENGTH                      equ 0001h
LCDD09_SEG13_MASK                        equ 0020h
LCDD09_SEG14_POSN                        equ 0006h
LCDD09_SEG14_POSITION                    equ 0006h
LCDD09_SEG14_SIZE                        equ 0001h
LCDD09_SEG14_LENGTH                      equ 0001h
LCDD09_SEG14_MASK                        equ 0040h
LCDD09_SEG15_POSN                        equ 0007h
LCDD09_SEG15_POSITION                    equ 0007h
LCDD09_SEG15_SIZE                        equ 0001h
LCDD09_SEG15_LENGTH                      equ 0001h
LCDD09_SEG15_MASK                        equ 0080h

// Register: LCDD10
#define LCDD10 LCDD10
LCDD10                                   equ 011Ah
// bitfield definitions
LCDD10_SEG16_POSN                        equ 0000h
LCDD10_SEG16_POSITION                    equ 0000h
LCDD10_SEG16_SIZE                        equ 0001h
LCDD10_SEG16_LENGTH                      equ 0001h
LCDD10_SEG16_MASK                        equ 0001h
LCDD10_SEG17_POSN                        equ 0001h
LCDD10_SEG17_POSITION                    equ 0001h
LCDD10_SEG17_SIZE                        equ 0001h
LCDD10_SEG17_LENGTH                      equ 0001h
LCDD10_SEG17_MASK                        equ 0002h
LCDD10_SEG18_POSN                        equ 0002h
LCDD10_SEG18_POSITION                    equ 0002h
LCDD10_SEG18_SIZE                        equ 0001h
LCDD10_SEG18_LENGTH                      equ 0001h
LCDD10_SEG18_MASK                        equ 0004h
LCDD10_SEG19_POSN                        equ 0003h
LCDD10_SEG19_POSITION                    equ 0003h
LCDD10_SEG19_SIZE                        equ 0001h
LCDD10_SEG19_LENGTH                      equ 0001h
LCDD10_SEG19_MASK                        equ 0008h
LCDD10_SEG20_POSN                        equ 0004h
LCDD10_SEG20_POSITION                    equ 0004h
LCDD10_SEG20_SIZE                        equ 0001h
LCDD10_SEG20_LENGTH                      equ 0001h
LCDD10_SEG20_MASK                        equ 0010h
LCDD10_SEG21_POSN                        equ 0005h
LCDD10_SEG21_POSITION                    equ 0005h
LCDD10_SEG21_SIZE                        equ 0001h
LCDD10_SEG21_LENGTH                      equ 0001h
LCDD10_SEG21_MASK                        equ 0020h
LCDD10_SEG22_POSN                        equ 0006h
LCDD10_SEG22_POSITION                    equ 0006h
LCDD10_SEG22_SIZE                        equ 0001h
LCDD10_SEG22_LENGTH                      equ 0001h
LCDD10_SEG22_MASK                        equ 0040h
LCDD10_SEG23_POSN                        equ 0007h
LCDD10_SEG23_POSITION                    equ 0007h
LCDD10_SEG23_SIZE                        equ 0001h
LCDD10_SEG23_LENGTH                      equ 0001h
LCDD10_SEG23_MASK                        equ 0080h

