GopalSaraf/Practicals/PSDL/include/proc/pic16c923.inc
// Register: LCDD11
#define LCDD11 LCDD11
LCDD11                                   equ 011Bh
// bitfield definitions
LCDD11_SEG24_POSN                        equ 0000h
LCDD11_SEG24_POSITION                    equ 0000h
LCDD11_SEG24_SIZE                        equ 0001h
LCDD11_SEG24_LENGTH                      equ 0001h
LCDD11_SEG24_MASK                        equ 0001h
LCDD11_SEG25_POSN                        equ 0001h
LCDD11_SEG25_POSITION                    equ 0001h
LCDD11_SEG25_SIZE                        equ 0001h
LCDD11_SEG25_LENGTH                      equ 0001h
LCDD11_SEG25_MASK                        equ 0002h
LCDD11_SEG26_POSN                        equ 0002h
LCDD11_SEG26_POSITION                    equ 0002h
LCDD11_SEG26_SIZE                        equ 0001h
LCDD11_SEG26_LENGTH                      equ 0001h
LCDD11_SEG26_MASK                        equ 0004h
LCDD11_SEG27_POSN                        equ 0003h
LCDD11_SEG27_POSITION                    equ 0003h
LCDD11_SEG27_SIZE                        equ 0001h
LCDD11_SEG27_LENGTH                      equ 0001h
LCDD11_SEG27_MASK                        equ 0008h
LCDD11_SEG28_POSN                        equ 0004h
LCDD11_SEG28_POSITION                    equ 0004h
LCDD11_SEG28_SIZE                        equ 0001h
LCDD11_SEG28_LENGTH                      equ 0001h
LCDD11_SEG28_MASK                        equ 0010h
LCDD11_SEG29_POSN                        equ 0005h
LCDD11_SEG29_POSITION                    equ 0005h
LCDD11_SEG29_SIZE                        equ 0001h
LCDD11_SEG29_LENGTH                      equ 0001h
LCDD11_SEG29_MASK                        equ 0020h
LCDD11_SEG30_POSN                        equ 0006h
LCDD11_SEG30_POSITION                    equ 0006h
LCDD11_SEG30_SIZE                        equ 0001h
LCDD11_SEG30_LENGTH                      equ 0001h
LCDD11_SEG30_MASK                        equ 0040h
LCDD11_SEG31_POSN                        equ 0007h
LCDD11_SEG31_POSITION                    equ 0007h
LCDD11_SEG31_SIZE                        equ 0001h
LCDD11_SEG31_LENGTH                      equ 0001h
LCDD11_SEG31_MASK                        equ 0080h

// Register: LCDD12
#define LCDD12 LCDD12
LCDD12                                   equ 011Ch
// bitfield definitions
LCDD12_SEG00_POSN                        equ 0000h
LCDD12_SEG00_POSITION                    equ 0000h
LCDD12_SEG00_SIZE                        equ 0001h
LCDD12_SEG00_LENGTH                      equ 0001h
LCDD12_SEG00_MASK                        equ 0001h
LCDD12_SEG01_POSN                        equ 0001h
LCDD12_SEG01_POSITION                    equ 0001h
LCDD12_SEG01_SIZE                        equ 0001h
LCDD12_SEG01_LENGTH                      equ 0001h
LCDD12_SEG01_MASK                        equ 0002h
LCDD12_SEG02_POSN                        equ 0002h
LCDD12_SEG02_POSITION                    equ 0002h
LCDD12_SEG02_SIZE                        equ 0001h
LCDD12_SEG02_LENGTH                      equ 0001h
LCDD12_SEG02_MASK                        equ 0004h
LCDD12_SEG03_POSN                        equ 0003h
LCDD12_SEG03_POSITION                    equ 0003h
LCDD12_SEG03_SIZE                        equ 0001h
LCDD12_SEG03_LENGTH                      equ 0001h
LCDD12_SEG03_MASK                        equ 0008h
LCDD12_SEG04_POSN                        equ 0004h
LCDD12_SEG04_POSITION                    equ 0004h
LCDD12_SEG04_SIZE                        equ 0001h
LCDD12_SEG04_LENGTH                      equ 0001h
LCDD12_SEG04_MASK                        equ 0010h
LCDD12_SEG05_POSN                        equ 0005h
LCDD12_SEG05_POSITION                    equ 0005h
LCDD12_SEG05_SIZE                        equ 0001h
LCDD12_SEG05_LENGTH                      equ 0001h
LCDD12_SEG05_MASK                        equ 0020h
LCDD12_SEG06_POSN                        equ 0006h
LCDD12_SEG06_POSITION                    equ 0006h
LCDD12_SEG06_SIZE                        equ 0001h
LCDD12_SEG06_LENGTH                      equ 0001h
LCDD12_SEG06_MASK                        equ 0040h
LCDD12_SEG07_POSN                        equ 0007h
LCDD12_SEG07_POSITION                    equ 0007h
LCDD12_SEG07_SIZE                        equ 0001h
LCDD12_SEG07_LENGTH                      equ 0001h
LCDD12_SEG07_MASK                        equ 0080h

// Register: LCDD13
#define LCDD13 LCDD13
LCDD13                                   equ 011Dh
// bitfield definitions
LCDD13_SEG08_POSN                        equ 0000h
LCDD13_SEG08_POSITION                    equ 0000h
LCDD13_SEG08_SIZE                        equ 0001h
LCDD13_SEG08_LENGTH                      equ 0001h
LCDD13_SEG08_MASK                        equ 0001h
LCDD13_SEG09_POSN                        equ 0001h
LCDD13_SEG09_POSITION                    equ 0001h
LCDD13_SEG09_SIZE                        equ 0001h
LCDD13_SEG09_LENGTH                      equ 0001h
LCDD13_SEG09_MASK                        equ 0002h
LCDD13_SEG10_POSN                        equ 0002h
LCDD13_SEG10_POSITION                    equ 0002h
LCDD13_SEG10_SIZE                        equ 0001h
LCDD13_SEG10_LENGTH                      equ 0001h
LCDD13_SEG10_MASK                        equ 0004h
LCDD13_SEG11_POSN                        equ 0003h
LCDD13_SEG11_POSITION                    equ 0003h
LCDD13_SEG11_SIZE                        equ 0001h
LCDD13_SEG11_LENGTH                      equ 0001h
LCDD13_SEG11_MASK                        equ 0008h
LCDD13_SEG12_POSN                        equ 0004h
LCDD13_SEG12_POSITION                    equ 0004h
LCDD13_SEG12_SIZE                        equ 0001h
LCDD13_SEG12_LENGTH                      equ 0001h
LCDD13_SEG12_MASK                        equ 0010h
LCDD13_SEG13_POSN                        equ 0005h
LCDD13_SEG13_POSITION                    equ 0005h
LCDD13_SEG13_SIZE                        equ 0001h
LCDD13_SEG13_LENGTH                      equ 0001h
LCDD13_SEG13_MASK                        equ 0020h
LCDD13_SEG14_POSN                        equ 0006h
LCDD13_SEG14_POSITION                    equ 0006h
LCDD13_SEG14_SIZE                        equ 0001h
LCDD13_SEG14_LENGTH                      equ 0001h
LCDD13_SEG14_MASK                        equ 0040h
LCDD13_SEG15_POSN                        equ 0007h
LCDD13_SEG15_POSITION                    equ 0007h
LCDD13_SEG15_SIZE                        equ 0001h
LCDD13_SEG15_LENGTH                      equ 0001h
LCDD13_SEG15_MASK                        equ 0080h

// Register: LCDD14
#define LCDD14 LCDD14
LCDD14                                   equ 011Eh
// bitfield definitions
LCDD14_SEG16_POSN                        equ 0000h
LCDD14_SEG16_POSITION                    equ 0000h
LCDD14_SEG16_SIZE                        equ 0001h
LCDD14_SEG16_LENGTH                      equ 0001h
LCDD14_SEG16_MASK                        equ 0001h
LCDD14_SEG17_POSN                        equ 0001h
LCDD14_SEG17_POSITION                    equ 0001h
LCDD14_SEG17_SIZE                        equ 0001h
LCDD14_SEG17_LENGTH                      equ 0001h
LCDD14_SEG17_MASK                        equ 0002h
LCDD14_SEG18_POSN                        equ 0002h
LCDD14_SEG18_POSITION                    equ 0002h
LCDD14_SEG18_SIZE                        equ 0001h
LCDD14_SEG18_LENGTH                      equ 0001h
LCDD14_SEG18_MASK                        equ 0004h
LCDD14_SEG19_POSN                        equ 0003h
LCDD14_SEG19_POSITION                    equ 0003h
LCDD14_SEG19_SIZE                        equ 0001h
LCDD14_SEG19_LENGTH                      equ 0001h
LCDD14_SEG19_MASK                        equ 0008h
LCDD14_SEG20_POSN                        equ 0004h
LCDD14_SEG20_POSITION                    equ 0004h
LCDD14_SEG20_SIZE                        equ 0001h
LCDD14_SEG20_LENGTH                      equ 0001h
LCDD14_SEG20_MASK                        equ 0010h
LCDD14_SEG21_POSN                        equ 0005h
LCDD14_SEG21_POSITION                    equ 0005h
LCDD14_SEG21_SIZE                        equ 0001h
LCDD14_SEG21_LENGTH                      equ 0001h
LCDD14_SEG21_MASK                        equ 0020h
LCDD14_SEG22_POSN                        equ 0006h
LCDD14_SEG22_POSITION                    equ 0006h
LCDD14_SEG22_SIZE                        equ 0001h
LCDD14_SEG22_LENGTH                      equ 0001h
LCDD14_SEG22_MASK                        equ 0040h
LCDD14_SEG23_POSN                        equ 0007h
LCDD14_SEG23_POSITION                    equ 0007h
LCDD14_SEG23_SIZE                        equ 0001h
LCDD14_SEG23_LENGTH                      equ 0001h
LCDD14_SEG23_MASK                        equ 0080h

// Register: LCDD15
#define LCDD15 LCDD15
LCDD15                                   equ 011Fh
// bitfield definitions
LCDD15_SEG24_POSN                        equ 0000h
LCDD15_SEG24_POSITION                    equ 0000h
LCDD15_SEG24_SIZE                        equ 0001h
LCDD15_SEG24_LENGTH                      equ 0001h
LCDD15_SEG24_MASK                        equ 0001h
LCDD15_SEG25_POSN                        equ 0001h
LCDD15_SEG25_POSITION                    equ 0001h
LCDD15_SEG25_SIZE                        equ 0001h
LCDD15_SEG25_LENGTH                      equ 0001h
LCDD15_SEG25_MASK                        equ 0002h
LCDD15_SEG26_POSN                        equ 0002h
LCDD15_SEG26_POSITION                    equ 0002h
LCDD15_SEG26_SIZE                        equ 0001h
LCDD15_SEG26_LENGTH                      equ 0001h
LCDD15_SEG26_MASK                        equ 0004h
LCDD15_SEG27_POSN                        equ 0003h
LCDD15_SEG27_POSITION                    equ 0003h
LCDD15_SEG27_SIZE                        equ 0001h
LCDD15_SEG27_LENGTH                      equ 0001h
LCDD15_SEG27_MASK                        equ 0008h
LCDD15_SEG28_POSN                        equ 0004h
LCDD15_SEG28_POSITION                    equ 0004h
LCDD15_SEG28_SIZE                        equ 0001h
LCDD15_SEG28_LENGTH                      equ 0001h
LCDD15_SEG28_MASK                        equ 0010h
LCDD15_SEG29_POSN                        equ 0005h
LCDD15_SEG29_POSITION                    equ 0005h
LCDD15_SEG29_SIZE                        equ 0001h
LCDD15_SEG29_LENGTH                      equ 0001h
LCDD15_SEG29_MASK                        equ 0020h
LCDD15_SEG30_POSN                        equ 0006h
LCDD15_SEG30_POSITION                    equ 0006h
LCDD15_SEG30_SIZE                        equ 0001h
LCDD15_SEG30_LENGTH                      equ 0001h
LCDD15_SEG30_MASK                        equ 0040h
LCDD15_SEG31_POSN                        equ 0007h
LCDD15_SEG31_POSITION                    equ 0007h
LCDD15_SEG31_SIZE                        equ 0001h
LCDD15_SEG31_LENGTH                      equ 0001h
LCDD15_SEG31_MASK                        equ 0080h

